"""


שעורי פייתון תרמו לי להכיר שפה כיפית, ידידותית וקלה יחסית ללמידה.
תודה על כל ההשקעה כל השעורים!!

יתרונות לשימוש בשפת פיתון:
1
 שפה סקריפטית, הקוד עובר קומפילציה רק בזמן ריצה. (בשונה משפות עליות אחרות כמו c# JAVA(
 2
 מכיוון שהיא יושבת על ספריות של C היא מהירה ביותר!!!!
 3
 שפה עם תחביר נקי, ולכן היא קלה להבנה. קל להבין קודים שכתובים בפייתון כי הביטויים ממש דומים לשפה המדוברת
 4
 שפה מונחית עצמים התומכת בריבוי תהליכים.
 5
 שפה חוצת פלטפורמות- ניתנת להרצה על מערכות הפעלה שונות.
 6
 Open-Source-קוד פתוח.

 בנוגע- לחוברת של GFG קראתי אותה בעיון.



 -----------------------------------GFG-----------------------
 תשובות לשאלות מ-GFG:
 ?מתי מתקמפל הקוד של שפת פייתון
 תשובה: בשונה משפות עליות שונות, הקוד של שפת פייותן מתקמפל בזמן ריצה!!

 מהי המשמעות של התו #?
 תשובה:
אחרי הסימון # כותבים בד"כ הערה!!

מה ההבדל בין // ל-/?
תשובה:
אם נשתמש ב- // נקבל תוצאה מעוגלת כלפי מטה.
שימוש ב/ נקבל תוצאה מדויקת כולל שבר.

האם פיתון תומכת בהורשה מרובה?
תשובה:
 כן, בשונה מ-c# & JAVA פייתון אכן תומכת בהורשה מרובה. המשמעות: מחלקה אחת תוכל להיות  בת לכמה מחלקות אב .



ברוך השם השעורים היו ברורים מאד. תודה על הכל1!!!!!!
"""